trade_exp/src/DataProcessors/СтароеРабочееМестоМенеджераДоставкеНДСБезНДС/СтароеРабочееМестоМенеджераДоставкеНДСБезНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СтароеРабочееМестоМенеджераДоставкеНДСБезНДС</name>
</mdclass:DataProcessor>

trade_exp/src/AccumulationRegisters/ЗаказыКДоставке/ЗаказыКДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="81e2ad59-db2f-44b0-bd59-b41113531600">
  <name>ЗаказыКДоставке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="b3b4dcbf-350b-46ea-a45e-8818c5c59d21">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="07059008-fa97-415d-a41f-dc26d7572867">
    <name>Рейс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="6e8dc3ce-4050-42cf-b74c-de0160eabf02">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1b3cd544-3144-477d-80f7-3e6b656db96c">
    <name>ДокументПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="9efb51da-7a4d-4d32-982b-58c144a21ccf">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5482fa87-20f2-4a19-ab14-873fb7ea7b95">
    <name>КОбеспечениюБезРезерва</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="efa2f5bc-0e1c-4dde-b69d-6348f7626468">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0607377e-fee8-4608-9afb-b5a6f4e840ad">
    <name>Резервировать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7661a70e-8eb4-4d91-802a-616a1ac841bb">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3edada72-6355-41c9-a573-31af580e1078">
    <name>Зарезервировано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="da36be43-5e81-4278-9f10-463495eba182">
    <name>Обеспечено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8144c0d0-6b3e-49b9-beb5-7d2291783cce">
    <name>НеОбеспечено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63380d67-a9d1-4dad-8840-41c7249204ab">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="1e4c922a-b382-44d6-9fd3-4680173f4a41">
    <name>Излишек</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="261e7ab2-2140-4288-a9b8-49b2ba6ae33a">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="07d9b412-d603-469e-ab48-60c2bfa34bee">
    <name>РезервироватьПоМереПоступленияИтогНаДату</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3b0831aa-fa4a-4ec4-a515-ac2d8dcc02ad">
    <name>НеОбеспеченоКОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aca20c25-c763-4dc8-909a-2cbf809a16f1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c3838a94-5f51-4ad4-832f-097e04916376">
    <name>ЗаказНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f4169bf1-1ff0-488a-99aa-221a36f91319">
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="2e9cee72-6315-424e-b5e7-2820869c03f8">
    <name>ЗаказНаПоступление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ee2253b1-ab42-48e3-9904-a2aee6d27c4d">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="01679aa4-d527-4955-8909-4fd6d96702ac">
    <name>ТипЗаписиРаспределенияЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыЗаказовНаДоставку/СтатусыЗаказовНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="001dd93b-cd26-4b28-8ae1-9d7129bc2202">
  <name>СтатусыЗаказовНаДоставку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1367a921-0ba4-4d75-8d60-7c37522518c2">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/СтароеРабочееМестоМенеджераДоставкеНДСБезНДС/Forms/Форма/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура Инициализировать()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи, "Основания", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Карта= Истина; 
	УстановитьВидДоставки(); 
	УстановитьВидимостьДоступность();
	РежимРаботы= 1;
	ИнициализироватьКарту(); 
КонецПроцедуры

&НаСервере 
Процедура УстановитьВидДоставки()
	ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК;
КонецПроцедуры
&НаКлиенте
Процедура ПулЗаказовПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи, "Основания", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
	Иначе
		Инициализировать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаказовОтметкаПриИзменении(Элемент)
	Попытка
		ДобавитьУдалитьЗаказВРейс();
	Исключение
		Сообщить("Ошибка сервияса геокодирования Яндекс");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	ИнициализироватьКарту();
	
	ОбновитьСписокДоставки(Неопределено);

	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ИнициализироватьКарту();
	
	ОбновитьСписокДоставки(Неопределено);

	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоТарифамПриИзменении(Элемент)
	ИнициализироватьКарту();
	
	ОбновитьСписокДоставки(Неопределено);

	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия
&НаКлиенте
Процедура ОтборПоТарифам(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	ПараметрыФормы.Вставить("ВыделитьСтрокиМассив", ПолучитьМассивТарифов());
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораТарифов", ЭтаФорма);

	ОткрытьФорму("Справочник.ТарифыПеревозчиков.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры
&НаСервере
Функция ПолучитьМассивТарифов()
	Возврат Тарифы.Выгрузить().ВыгрузитьКолонку("Тариф");
КонецФункции
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораТарифов(МассивТарифов, ДопПараметры) Экспорт
	Если МассивТарифов <> Неопределено Тогда
		Тарифы.Очистить();
		
		Для Каждого ЭлементМассива Из МассивТарифов Цикл
			НоваяСтрока = Тарифы.Добавить();
			НоваяСтрока.Тариф = ЭлементМассива;
		КонецЦикла;
		
		Если ИспользоватьОтборПоТарифам Тогда 
			ИнициализироватьКарту();
			ОбновитьСписокДоставки(Неопределено);
			УстановитьВидимостьДоступность();
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДоставки(Команда)
	ОбновитьСписокДоставкиНаСервере();
	ЗаказыВРейс.Очистить();
КонецПроцедуры
&НаСервере
Процедура ОбновитьСписокДоставкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|		ЗаданиеНаПеревозкуРейсОснования.Ссылка КАК Рейс,
	|		ЗаданиеНаПеревозкуРейсОснования.Документ КАК ЗаказНаДоставку
	|	ПОМЕСТИТЬ Рейсы
	|	ИЗ
	|		Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
	|	ГДЕ
	|		ЗаданиеНаПеревозкуРейсОснования.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		РегистрНакопленияЗаказыКДоставкеОстатки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|		СУММА(РегистрНакопленияЗаказыКДоставкеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|	ПОМЕСТИТЬ ВТ_ЗаказыКДоставке
	|	ИЗ
	|		РегистрНакопления.ЗаказыКДоставке.Остатки КАК РегистрНакопленияЗаказыКДоставкеОстатки
	|	ГДЕ
	|		РегистрНакопленияЗаказыКДоставкеОстатки.КоличествоОстаток > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РегистрНакопленияЗаказыКДоставкеОстатки.ЗаказНаДоставку
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|		Обеспечение.Назначение КАК Назначение,
	|		Обеспечение.Назначение.Заказ КАК НазначениеЗаказ
	|	ПОМЕСТИТЬ ВТ_ЗаказыПодНазначение
	|	ИЗ
	|		(ВЫБРАТЬ
	|	ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК Поступило,
	|	СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) КАК Отгрузить,
	|	СУММА(РаспределениеЗапасов.Зарезервировано) КАК КОбеспечениюБезРезерва
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
	|		ПО (ЗапасыИПотребностиОстатки.Назначение = ТоварыКОтгрузкеОстатки.Назначение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО (ЗапасыИПотребностиОстатки.Назначение = РаспределениеЗапасов.Назначение)
	|ГДЕ
	|	НЕ ЗапасыИПотребностиОстатки.Назначение.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребностиОстатки.Назначение) КАК Обеспечение
	|	ГДЕ
	|		Обеспечение.Поступило > 0
	|		И Обеспечение.Поступило = Обеспечение.КОбеспечениюБезРезерва
	|		И НЕ Обеспечение.Назначение.Ссылка ЕСТЬ NULL
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ЗаказНаДоставкуКлиентуОснования.Документ КАК ДокументПродажи,
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка КАК ЗаказНаДоставку,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗаказНаДоставкуКлиентуОснования.Документ.Кассир.Ссылка, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ОтметкаКассы,
	|		НЕОПРЕДЕЛЕНО КАК ПодНазначение
	|	ПОМЕСТИТЬ ВТ_ОтметкаКассы
	|	ИЗ
	|		Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
	|	ГДЕ
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
	|				ИЗ
	|					ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
	|		И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказНаДоставкуКлиентуОснования.Документ,
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка,
	|		ВЫБОР
	|			КОГДА ЗаказНаДоставкуКлиентуОснования.Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
	|	ГДЕ
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
	|				ИЗ
	|					ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
	|		И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.ЧекККМ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказНаДоставкуКлиентуОснования.Документ,
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РеализацияТоваровУслуг.Кассир.Ссылка, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ,
	|		ЕСТЬNULL(ВТ_ЗаказыПодНазначение.Назначение, НЕОПРЕДЕЛЕНО)
	|	ИЗ
	|		Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО ЗаказНаДоставкуКлиентуОснования.Документ = РеализацияТоваровУслуг.ЗаказКлиента
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПодНазначение КАК ВТ_ЗаказыПодНазначение
	|			ПО ЗаказНаДоставкуКлиентуОснования.Документ = ВТ_ЗаказыПодНазначение.НазначениеЗаказ
	|	ГДЕ
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
	|				ИЗ
	|					ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
	|		И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.ЗаказКлиента
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ВТ_ОтметкаКассы.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|		МИНИМУМ(ВТ_ОтметкаКассы.ОтметкаКассы) КАК ОтметкаКассы,
	|		ВТ_ОтметкаКассы.ПодНазначение КАК ПодНазначение
	|	ПОМЕСТИТЬ ВТ_ОтметкаКассыОбъединение
	|	ИЗ
	|		ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ОтметкаКассы.ЗаказНаДоставку,
	|		ВТ_ОтметкаКассы.ПодНазначение
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		СУММА(ИтогРеализацииИЧеки.КоличествоДокументовПродажи) КАК КоличествоДокументовПродажи,
	|		ИтогРеализацииИЧеки.ЗаказНаДоставку КАК ЗаказНаДоставку
	|	ПОМЕСТИТЬ ВТ_РеализацииИЧеки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи) КАК КоличествоДокументовПродажи,
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку КАК ЗаказНаДоставку
	|		ИЗ
	|			ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
	|		ГДЕ
	|			ВТ_ОтметкаКассы.ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи),
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		ИЗ
	|			ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
	|		ГДЕ
	|			ВТ_ОтметкаКассы.ДокументПродажи ССЫЛКА Документ.ЧекККМ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи),
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_ОтметкаКассы_Заказ.ДокументПродажи КАК ДокументПродажи,
	|				ВТ_ОтметкаКассы_Заказ.ЗаказНаДоставку КАК ЗаказНаДоставку
	|			ИЗ
	|				ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы_Заказ
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|					ПО ВТ_ОтметкаКассы_Заказ.ДокументПродажи = Реализация.Ссылка.ЗаказКлиента
	|			ГДЕ
	|				ВТ_ОтметкаКассы_Заказ.ДокументПродажи ССЫЛКА Документ.ЗаказКлиента) КАК ВТ_ОтметкаКассы
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку) КАК ИтогРеализацииИЧеки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ИтогРеализацииИЧеки.ЗаказНаДоставку
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказНаДоставкуКлиенту.ПрибытиеНаОтгрузку КАК ПрибытиеНаОтгрузку,
	|		ЗаказНаДоставкуКлиенту.ВремяДоставкиС КАК ВремяДоставкиС,
	|		ЗаказНаДоставкуКлиенту.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|		ЗаказНаДоставкуКлиенту.Вес КАК Вес,
	|		ЗаказНаДоставкуКлиенту.Объем КАК Объем,
	|		ЗаказНаДоставкуКлиенту.АдресДоставки КАК АдресДоставки,
	|		ЗаказНаДоставкуКлиенту.Широта КАК Широта,	
	|		ЗаказНаДоставкуКлиенту.Долгота КАК Долгота,		
	|		ЗаказНаДоставкуКлиенту.Ссылка КАК ЗаказНаДоставку,
	|		ЗаказНаДоставкуКлиенту.СуммаДокумента КАК Выручка,
	|		ЗаказНаДоставкуКлиенту.Партнер КАК Клиент,
	|		ЗаказНаДоставкуКлиенту.ТелефонКлиента КАК Телефон,
	|		ЗаказНаДоставкуКлиенту.ТелефонКлиентаНаВыгрузке КАК ТелефонНаВыгрузки,
	|		ЗаказНаДоставкуКлиенту.СтоимостьДоставки КАК ТранспортныеРасходы,
	|		ЗаказНаДоставкуКлиенту.Номер КАК Номер,
	|		ЗаказНаДоставкуКлиенту.Дата КАК Дата,
	|		ЗаказНаДоставкуКлиенту.Подразделение КАК Подразделение,
	|		ЗаказНаДоставкуКлиенту.ЭкспрессДоставка КАК ЭкспрессДоставка,
	|		ЗаказНаДоставкуКлиенту.ССайта КАК ССайта,
	|		ЗаказНаДоставкуКлиенту.Организация КАК Организация,
	|		ЗаказНаДоставкуКлиенту.ДоставкаСРазгрузкой КАК ДоставкаСРазгрузкой,
	|		ЗаказНаДоставкуКлиенту.СтоимостьДоставки КАК СтоимостьДоставки,
	|		ЗаказНаДоставкуКлиенту.СтоимостьДоставкиСНДС КАК СтоимостьДоставкиСНДС,
	|		ЗаказНаДоставкуКлиенту.ВидРазгрузки КАК ВидРазгрузки,
	|		ЗаказНаДоставкуКлиенту.МаксимальнаяДлина КАК МаксимальнаяДлина,
	|		ЗаказНаДоставкуКлиенту.ВидДоставки КАК ВидДоставки,
	|		ЗаказНаДоставкуКлиенту.НужнаИнкассация КАК НужнаИнкассация,
	|		ЗаказНаДоставкуКлиенту.НаправлениеДоставки КАК НаправлениеДоставки,
	|		ВЫБОР
	|			КОГДА ЗаказНаДоставкуКлиенту.Объем <> 0
	|				ТОГДА ЗаказНаДоставкуКлиенту.Вес / ЗаказНаДоставкуКлиенту.Объем
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесКОбъему,
	|		ЗаказНаДоставкуКлиенту.Инкассация КАК СуммаИнкассации,
	|		ЕСТЬNULL(ВТ_ОтметкаКассы.ОтметкаКассы, 0) КАК ОтметкаКассы,
	|		ВТ_ЗаказыКДоставке.ЗаказНаДоставку.Инкассация КАК Инкассация,
	|		ЕСТЬNULL(ВТ_РеализацииИЧеки.КоличествоДокументовПродажи, 0) КАК КоличествоДокументовПродажи,
	|		ВТ_ЗаказыКДоставке.ЗаказНаДоставку.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой,
	|		ВТ_ОтметкаКассы.ПодНазначение КАК ПодНазначение,
	|		ЗаказНаДоставкуКлиенту.ЕстьЗаявкаЛесЕГАИС КАК ЕстьЗаявкаЛесЕГАИС,
	|		ЗаказНаДоставкуКлиенту.Тариф КАК Тариф,
	|		ЗаказНаДоставкуКлиенту.Тариф.ГрузоподъемностьВТоннах КАК ТарифГрузоподъемностьВТоннах
	|	ИЗ
	|		ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
	|			ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ЗаказНаДоставкуКлиенту.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтметкаКассыОбъединение КАК ВТ_ОтметкаКассы
	|			ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ВТ_ОтметкаКассы.ЗаказНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииИЧеки КАК ВТ_РеализацииИЧеки
	|			ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ВТ_РеализацииИЧеки.ЗаказНаДоставку
	|	ГДЕ
	|		ИСТИНА
	|		И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение
	|		И ЗаказНаДоставкуКлиенту.ПрибытиеНаОтгрузку МЕЖДУ &Дата1 И &Дата2
	|		И ЗаказНаДоставкуКлиенту.ВидДоставки В(&мВидДоставки)
	|	   И ЗаказНаДоставкуКлиенту.Тариф В(&Тарифы)
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		ЭкспрессДоставка УБЫВ,
	|		ПрибытиеНаОтгрузку,
	|		ВремяДоставкиС";
	
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	Если ИспользоватьОтборПоТарифам Тогда
		Запрос.УстановитьПараметр("Тарифы", Тарифы.Выгрузить().ВыгрузитьКолонку("Тариф"));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.Тариф В(&Тарифы)", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		Запрос.УстановитьПараметр("Подразделение", Филиал);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение", "");
	КонецЕсли;
	                                                   
	Если ЗначениеЗаполнено(ВидДоставки) Тогда
		мВидДоставки = Новый Массив;
		мВидДоставки.Добавить(ВидДоставки);
		Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда
			мВидДоставки.Добавить(Перечисления.ВидыДоставокДоКлиента.Внутренняя);
		КонецЕсли;
		Запрос.УстановитьПараметр("мВидДоставки", мВидДоставки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.ВидДоставки В(&мВидДоставки)", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ПулЗаказов.Загрузить(РезультатЗапроса.Выгрузить());
	
	Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда
		Выборка = Документы.ЗаказНаДоставкуКлиенту.ПолучитьКоличествоЗаказовНаДоставку(ТекущаяДата(), Филиал);
		сч = 1;
		Пока Выборка.Следующий() Цикл
			ИмяЭлемента = "Интервал" + сч;
			Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаИнтервалы);
			КонецЕсли;
			Элементы[ИмяЭлемента].Заголовок = Выборка.Наименование + ": " + Выборка.КолЗаказов;
			сч = сч + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ФункцииОбработки

&НаКлиенте
Процедура ПулЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	Док= Элементы.ПулЗаказов.ТекущиеДанные.ЗаказНаДоставку;
	Если Не Док.Пустая() Тогда 	
		ОткрытьФорму("Документ.ЗаказНаДоставкуКлиенту.ФормаОбъекта", Новый Структура("Ключ", Док));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОснования(Ссылка)
	мОснований= Новый Массив;
	Для Каждого стрОснования Из Ссылка.Основания Цикл
		мОснований.Добавить(стрОснования.Документ);
	КонецЦикла;
	Возврат мОснований;
КонецФункции

&НаКлиенте
Процедура РасчитатьИтоги()
	Ном= 1;
	ВесИтог= 0;
	ОбъемИтог= 0;
	МаксимальнаяДлинна= 0;
	Расстояние= 0;
	ВремяВПути= 0;
	ВремяРазгрузки= 0;
	СтоимостьДоставки= 0;
	СтоимостьДоставкиСНДС= 0;
	Для Каждого стрДоставки Из ЗаказыВРейс Цикл
		стрДоставки.НомерСтроки= Ном;
		Ном= Ном+1;
		ВесИтог= ВесИтог+стрДоставки.Вес;
		ОбъемИтог= ОбъемИтог+стрДоставки.Объем;
		МаксимальнаяДлинна= Макс(МаксимальнаяДлинна, стрДоставки.МаксимальнаяДлина);
		Расстояние= Расстояние+стрДоставки.Расстояние;
		ВремяВПути= ВремяВПути+стрДоставки.ВремяВПути;
		ВремяРазгрузки= ВремяРазгрузки+стрДоставки.ВремяРазгрузки;
		СтоимостьДоставки= СтоимостьДоставки+стрДоставки.СтоимостьДоставки;
		СтоимостьДоставкиСНДС= СтоимостьДоставкиСНДС+стрДоставки.СтоимостьДоставкиСНДС;
	КонецЦикла;
	Элементы.ЗаказыВРейсыВес.ТекстПодвала= ВесИтог;
	Элементы.ЗаказыВРейсыОбъем.ТекстПодвала= ОбъемИтог;
	Элементы.ЗаказыВРейсыМаксимальнаяДлина.ТекстПодвала= МаксимальнаяДлинна;
	Элементы.ЗаказыВРейсыРасстояние.ТекстПодвала= Расстояние;
	Элементы.ЗаказыВРейсыВремяВПути.ТекстПодвала= ВремяВПути;
	Элементы.ЗаказыВРейсыВремяРазгрузки.ТекстПодвала= ВремяРазгрузки;
	Элементы.ЗаказыВРейсСтоимостьДоставки.ТекстПодвала= СтоимостьДоставки;
	Элементы.ЗаказыВРейсСтоимостьДоставкиСНДС.ТекстПодвала= СтоимостьДоставкиСНДС;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУдалитьЗаказВРейс()
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	
	Если ТекущаяСтрока.Отметка Тогда
		НоваяСтрока= ЗаказыВРейс.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.НомерСтроки= ЗаказыВРейс.Количество();
		
		Если Карта Тогда
			ДобавитьТочкуНаКарту(НоваяСтрока.АдресДоставки, НоваяСтрока.Широта, НоваяСтрока.Долгота);
		КонецЕсли;
	Иначе
		Строки= ЗаказыВРейс.НайтиСтроки(Новый Структура ("ЗаказНаДоставку", ТекущаяСтрока.ЗаказНаДоставку));
		Для Каждого Строка Из Строки Цикл
			ЗаказыВРейс.Удалить(ЗаказыВРейс.Индекс(Строка));
		КонецЦикла;
		
	КонецЕсли;
	РасчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная") Тогда
		Элементы.ДокументыДоставкиНаправлениеДоставки.Видимость= Ложь;
		Элементы.ГруппаИнтервалы.Видимость= Истина;
	Иначе 
		Элементы.ДокументыДоставкиНаправлениеДоставки.Видимость= Истина;
		Элементы.ГруппаИнтервалы.Видимость= Ложь;
	КонецЕсли;
	
	Если Карта Тогда 
		Элементы.ГруппаПраво.Видимость= Истина;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Истина;
	Иначе
		Элементы.ГруппаПраво.Видимость= Ложь;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОформитьДокументы

&НаКлиенте
Процедура СоздатьРейс(Команда)
	Если СуществуютДублиСкладов() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРейсНаКлиенте();
КонецПроцедуры

&НаСервере
Функция СуществуютДублиСкладов()
	Возврат Документы.ЗаданиеНаПеревозкуРейс.ПроверитьДублиСкладОтправитьСкладПолучатель(ЗаказыВРейс.Выгрузить( , "ЗаказНаДоставку").ВыгрузитьКолонку(0));
КонецФункции

&НаКлиенте
Процедура СоздатьРейсНаКлиенте()                                                       
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", МассивЗаказовВРейс());
	ПараметрыФормы.Вставить("ВызовИзОбработкиРабочееМестоМенеджераПоДоставке", Истина);
	
	ОткрытьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция МассивЗаказовВРейс()
	Массив = РеквизитФормыВЗначение("ЗаказыВРейс").ВыгрузитьКолонку("ЗаказНаДоставку");
	Документы.ЗаданиеНаПеревозкуРейс.ИзменениеСтатусовДляДокументовОснований(Массив, Перечисления.СтатусыЗаказовНаДоставку.ВРейсе);            
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ЗаказыВРейсыПриИзменении(Элемент)
	РасчитатьИтоги();
КонецПроцедуры
#КонецОбласти

#Область КАРТА
#Область СобытияКарты
&НаКлиенте
Процедура ОбновитьТочкиНаКарте(Команда)
	для Каждого стрЗаказа Из ЗаказыВРейс Цикл
		Если Карта Тогда
			ДобавитьТочкуНаКарту(стрЗаказа.АдресДоставки, стрЗаказа.Широта, стрЗаказа.Долгота);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКарту(Команда)
		КартаДокумент= Элементы.КартаЯндекс.Документ;
		
		КартаДокумент.defaultView.initMap();
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьМаршрутRoute(Команда)
	Попытка
		КартаДокумент= Элементы.КартаЯндекс.Документ;
		
		КартаДокумент.defaultView.calcRouter();
	Исключение
		Сообщить("Ошибка сервияса геокодирования Яндекс");
	КонецПопытки;
КонецПроцедуры

#КонецОбласти


#Область ИнициализацияКарты
&НаКлиенте
Процедура ИнициализироватьКарту()
	ИнициализироватьКартуНаСервере()
КонецПроцедуры
&НаСервере
Процедура ИнициализироватьКартуНаСервере()
	Парам= Обработки.КартографическийИнтерфейсДоставка.ПолучитьСтруктуруПараметров();
	Парам.Вставить("ВидДоставки", ВидДоставки);
	Парам.Вставить("Филиал", Филиал);

	Обработки.КартографическийИнтерфейсДоставка.ИнициализироватьКартуТолькоЗоны(КартаЯндекс, Парам);
КонецПроцедуры
#КонецОбласти

#Область Геокодирование
&НаКлиентеНаСервере
Функция ПолучитьДанныеСКарты(ПеременныеКарты)
	ДанныеКарты= Новый Структура;
	ДанныеКарты.Вставить("Адрес", ПеременныеКарты.Address);
	ДанныеКарты.Вставить("РасчетПоРасстоянию", ПеременныеКарты.distanceCalc);
	ДанныеКарты.Вставить("СтоимостьПоРасстоянию", ПеременныеКарты.distanseCost);
	ДанныеКарты.Вставить("СтоимостьДоставки", ПеременныеКарты.price);
	ДанныеКарты.Вставить("Зона", ПеременныеКарты.zone);
КонецФункции

&НаКлиенте
Процедура ДобавитьТочкуНаКарту(АдресДоставки, Широта = 0, Долгота = 0)
	КартаДокумент= Элементы.КартаЯндекс.Документ;
	
	Если Широта <>  0 Тогда 
		КартаДокумент.defaultView.addMarkerOnCoords(Широта, Долгота, АдресДоставки);
	Иначе
		КартаДокумент.defaultView.addMarkerOnAdress(АдресДоставки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	ТекущаяСтрока=Элементы.ПулЗаказов.ТекущиеДанные;
	если ТекущаяСтрока<>Неопределено тогда
		если значениезаполнено(ТекущаяСтрока.ПодНазначение) тогда	
			СоздатьРеализациюСервер(ТекущаяСтрока.ПодНазначение);	
		иначе
			Сообщить("Документ основания не является обособленным. Создание реализации не требуется.");
		конецесли;
	конецесли;	
	
	
КонецПроцедуры

Процедура СоздатьРеализациюСервер(Назначение)
	УстановитьПривилегированныйРежим(истина);
	
	НачатьТранзакцию();
	
		ЗаказКлиента= Назначение.Заказ;
		
		Если Не ЗначениеЗаполнено(ЗаказКлиента.Кассир) Тогда
			Сообщить("На документ "+ЗаказКлиента+"не установлена отметка кассы.");
			возврат;
		КонецЕсли;
		
		ЗаказОбъект= ЗаказКлиента.ПолучитьОбъект();
		Для Каждого стрТовар Из ЗаказОбъект.Товары Цикл
			Если стрТовар.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно ИЛИ стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.НеТребуется Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
				стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно;
			Иначе
				стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
			КонецЕсли;
		КонецЦикла;
		Отказ=ложь;
		Попытка
			ЗаказОбъект.ДополнительныеСвойства.Вставить("Регламент", Истина);
			
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказОбъект.Ссылка, "Отгружен: "+ЗаказОбъект.Ссылка);
		Исключение
			Отказ= Истина;
			Текст= "Не удалось записать: "+ЗаказОбъект.Ссылка;
			АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказОбъект.Ссылка, Текст);
		//	ЗаписьЖурналаРегистрации("РегламентноеЗадание.АвтоматическоеСозданиеРеализацийПоЗаказам", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		КонецПопытки;
		
		Если Не Отказ Тогда
			Док= Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ДанныеЗаполнения= Новый Структура;
			ДанныеЗаполнения.Вставить("ВариантОформленияПродажи", Перечисления.ВариантыОформленияПродажи);
			ДанныеЗаполнения.Вставить("ДокументОснование", ЗаказКлиента);
			ДанныеЗаполнения.Вставить("СкладОтгрузки", Неопределено);
			Док.Заполнить(ДанныеЗаполнения);
			
			Док.Склад= ЗаказКлиента.Склад;
			Док.Комментарий= "Создан автоматически по заказу с отметкой кассы";
			Док.Дата= ТекущаяДата();
			Док.Менеджер= ЗаказКлиента.Менеджер;
			Док.Магазин= ЗаказКлиента.Магазин;
			Если Док.Товары.Количество() > 0 Тогда 
				Попытка
					Док.СкидкиРассчитаны=истина;
					Док.Записать(РежимЗаписиДокумента.Проведение);
					АльтерраОбщегоНазначения.СообщитьПользователю(Док.Ссылка, "Создан: "+Док.Ссылка);
				Исключение
					Отказ= Истина;
					Текст= "Не удалось записать: "+Док.Ссылка;
					АльтерраОбщегоНазначения.СообщитьПользователю(Док.Ссылка, Текст);
				КонецПопытки;
				
				Если Не Отказ Тогда
					НужнаЗаявка= Документы.ЗаявкаВЕГАИСЛес.ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(Док.Ссылка);
					
					Если НужнаЗаявка Тогда
						ДокЗаявка= Документы.ЗаявкаВЕГАИСЛес.СоздатьДокумент();
						ДокЗаявка.Дата= ТекущаяДата();
						ДокЗаявка.Заполнить(Док.Ссылка);
						Попытка
							ДокЗаявка.Записать(РежимЗаписиДокумента.Проведение);
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЗаявка.Ссылка, "Создан: "+ДокЗаявка.Ссылка);
						Исключение
							Отказ= Истина;
							Текст= "Не удалось записать: "+ДокЗаявка.Ссылка;
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЗаявка.Ссылка, Текст);
						КонецПопытки;
					КонецЕсли;
					
					Если Док.ИспользуетсяДоговор Тогда
						ДокЛистСогласования = Документы.ЛистСогласования.СоздатьДокумент();
						ДокЛистСогласования.Дата = ТекущаяДата();
						ДокЛистСогласования.Заполнить(Док.Ссылка);
						ДокЛистСогласования.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления;
						ДокЛистСогласования.Проблема = Справочники.Проблемы.НайтиПоКоду("000000016");//Реализация (отсутствие оригинала/некорректное оформление -ПАКЕТ ДОКУМЕНТОВ)
						
						Если Док.Партнер<>Справочники.Партнеры.ПустаяСсылка() и Док.Партнер.ОсновнойМенеджер<>Справочники.Пользователи.ПустаяСсылка() и СтрНайти(Док.Партнер.ОсновнойМенеджер.Наименование, "Сектор выписки")=0 Тогда
							ДокЛистСогласования.ОсновнойМенеджер = Док.Партнер.ОсновнойМенеджер;
						Иначе
							ДокЛистСогласования.ОсновнойМенеджер = Док.ЗаказКлиента.Менеджер;
						КонецЕсли;
						ДокЛистСогласования.Согласовано = Справочники.ПользователиДляСогласованияЛистов.НайтиПоКоду("000000035");//Тупицына Оксана Геннадьевна
						ДокЛистСогласования.Согласован = Истина;
						ДокЛистСогласования.Комментарий = "Создан автоматически по заказу с отметкой кассы";
						Попытка
							ДокЛистСогласования.Записать(РежимЗаписиДокумента.Проведение);
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЛистСогласования.Ссылка, "Создан: "+ДокЛистСогласования.Ссылка);
						Исключение
							Отказ = Истина;
							Текст = "Не удалось записать: " + ДокЛистСогласования.Ссылка;
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЛистСогласования.Ссылка, Текст);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Текст= "Не удалось установить вариант обеспечение отгрузить: "+ЗаказКлиента;
		АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказКлиента, Текст);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	

КонецПроцедуры
#КонецОбласти
#КонецОбласти
